<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Real-time Multi-series Chart.js Example with Multiple Y-Axes</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css" type="text/css" rel="stylesheet" />
    <script src="https://code.jquery.com/jquery-3.6.4.min.js" type="text/javascript"></script>
    <script src="https://cdn.jsdelivr.net/npm/chart.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/chartjs-adapter-date-fns"></script>
    <style>
        /* Стили для контейнера графика */
        .chart-container {
            position: relative;
            width: 800px;
            /*            width: 100%;*/
            height: 400px; /* Можно настроить высоту как нужно */
        }

        /* Стили для canvas */
        canvas {
            width: 100% !important;
            height: 100% !important;
        }
    </style>
</head>
<body>
        <div class="card">
            <div class="card-header">
                <table cellpadding="14" border="0">
                    <tr>
                        <td id="time">
                        </td>
                        <td id="len_sec" title="Bytes recieved per second">
                            Bytes recieved per second
                        </td>
                        <td id="packages_sec" title="Packages recieved per second">
                            Packages recieved per second
                        </td>
                        <td id="tags_changed_sec" title="Tags changed per second">
                            Tags changed per second
                        </td>

                    </tr>
                </table>
            </div>
        </div>
        <div class="chart-container">
            <canvas id="realTimeChart"></canvas>
        </div>
        <script>
            const config = {
                type: 'line',
                data: {
                    datasets: [
                        {
                            label: 'Series 1',
                            data: [], // Данные первой серии
                            borderColor: 'rgba(75, 192, 192, 1)',
                            borderWidth: 2,
                            fill: false,
                            stepped: false,
                            tension: 0.1, // Значение сглаживания для первой серии
                            yAxisID: 'y1', // Привязка к первой оси Y
                            radius: 0,
                            
                        },
                        {
                            label: 'Series 2',
                            data: [], // Данные второй серии
                            borderColor: 'rgba(255, 99, 132, 1)',
                            borderWidth: 2,
                            fill: false,
                            tension: 0.4, // Значение сглаживания для второй серии
                            yAxisID: 'y2', // Привязка к первой оси Y
                            radius: 0
                        }
                    ]
                },
                options: {
                    scales: {
                        x: {
                            type: 'time',
                            time: {
                                unit: 'second',
                                displayFormats: {
                                    second: 'HH:mm:ss' // Формат отображения времени
                                }
                            },
                            title: {
                                display: true,
                                text: 'Time',
                                fontSize: 4 // Размер шрифта для меток времени
                            },
                            ticks: {
                                font: {
                                    size: 10 // Размер шрифта для меток оси X
                                }
                            }
                        },
                        y1: {
                            type: 'linear',
                            position: 'left',
                            beginAtZero: true,
                            title: {
                                display: true,
                                text: 'Series 1 Values'
                            }
                        },
                        y2: {
                            type: 'linear',
                            position: 'left',
                            beginAtZero: true,
                            title: {
                                display: true,
                                text: 'Series 2 Values'
                            },
                            grid: {
                                drawOnChartArea: false // Отключает отображение сетки для правой оси Y
                            }
                        }
                    },
                    plugins: {
                        legend: {
                            position: 'right' // Перемещаем легенду направо
                        }
                    },
                    responsive: true,
                    maintainAspectRatio: false,
                    animation: false // Отключаем анимацию
                }
            };

            const ctx = document.getElementById('realTimeChart').getContext('2d');
            const realTimeChart = new Chart(ctx, config);

            const timeWindow = 20 * 1000; // Временное окно в миллисекундах (например, 20 секунд)

            function addData(seriesIndex, value, timestamp) {
                const dataset = config.data.datasets[seriesIndex];
                console.log(" " + seriesIndex + ' ' + value + ' ' + timestamp);
                // Добавляем новые данные
                dataset.data.push({ x: timestamp, y: value });

                // Удаляем старые данные, которые выходят за пределы временного окна
                const cutoffTime = Date.now() - timeWindow;
                dataset.data = dataset.data.filter(point => point.x >= cutoffTime);

                realTimeChart.update();
            }

            // Имитация получения данных в реальном времени
            setInterval(() => {
                const now = new Date();
                const value1 = Math.random() * -90; // Случайное значение для серии 1
                const value2 = Math.random() * 1000; // Случайное значение для серии 2
                //addData(0, value1, now);
                if (value2 > 50) {
              //      addData(1, value2, now);
                }
            }, 100); // Обновляем данные каждые 100 миллисекунд
        </script>
        <script type="text/javascript">
            var len = 0;
            var packages = 0;
            var tags_changed = 0;
            var len_sec = 0;
            var tags_changed_sec = 0;
            var packages_sec = 0;
            function secTimer() {
                put_val_by_id('len_sec', len_sec, '');
                put_val_by_id('tags_changed_sec', tags_changed_sec, '');
                put_val_by_id('packages_sec', packages_sec, '');
                len_sec = 0;
                tags_changed_sec = 0;
                packages_sec = 0;
		addData(0, last_val, new Date());
		console.log('last_val = ' + last_val);

            }
            var show_chart = '';
            var last_val = '';
            $(document).ready(function () {
                const url = window.location.href;
                const urlParams = new URLSearchParams(window.location.search);
                show_chart = urlParams.get('show_chart');
                //if (show_chart == null) { show_chart = 148; }
                console.log('show_chart = ' + show_chart);
                const wsUri = "ws://127.0.0.1:8008/";
                const websocket = new WebSocket(wsUri);
                setInterval(secTimer, 1000);
                $(document).on("click", "#boton", onClickButton);
                websocket.onopen = (e) => {
                    writeToScreen("CONNECTED");
                    //query = '{"items":[{"id": "tag1","sname": "job_control","cur_val": "300"},{"id": "tag11","sname": "control","cur_val": "310"}],"tags":[1,2,3,4],"now": "27.03.2023 21:22:23.44","limit": 25}';
                    //query = '?form_name=test&abributes=brief&tags=0,1,2,3,4'
                    //                query = '?form_name=test&abributes=brief&tags=0,1,2,66,666';
                    //                query = '?form_name=test&abributes=brief&tags=66';
                    //,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,528,529,530,531,532,533,534,535,536,537,538,539,540,541,542,543,544,545,546,547,548,549,550,551,552,553,554,555,556,557,558,559,560,561,562,563,564,565,566,567,568,569,570,571,572,573,574,575,576,577,578,579,580,581,582,583,584,585,586,587,588,589,590,591,592,593,594,595,596,597,598,599,600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621,622,623,624,625,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,641,642,643,644,645,646,647,648,649,650,651,652,653,654,655,656,657,658,659,660,661,662,663,664,665,666,667,668,669,670,671,672,673,674,675,676,677,678,679,680,681,682,683,684,685,686,687,688,689,690,691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,735,736,737,738,739,740,741,742,743,744,745,746,747,748,749,750,751,752,753,754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,769,770,771,772,773,774,775,776,777,778,779,780,781,782,783,784,785,786,787,788,789,790,791,792,793,794,795,796,797,798,799,800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,842,843,844,845,846,847,848,849,850,851,852,853,854,855,856,857,858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,874,875,876,877,878,879,880,881,882,883,884,885,886,887,888,889,890,891,892,893,894,895,896,897,898,899,900,901,902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917,918,919,920,921,922,923,924,925,926,927,928,929,930,931,932,933,934,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,957,958,959,960,961,962,963,964,965,966,967,968,969,970,971,972,973,974,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999';
                    //                query = '?form_name=test&abributes=brief&tags=0,1,4,7,999,';
                    //query = '?form_name=test&abributes=brief&tags=0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,376,377,378,379,380,381,382,383,384,385,386,387,388,389,390,391,392,393,394,395,396,397,398,399,400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,443,444,445,446,447,448,449,450,451,452,453,454,455,456,457,458,459,460,461,462,463,464,465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,486,487,488,489,490,491,492,493,494,495,496,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,528,529,530,531,532,533,534,535,536,537,538,539,540,541,542,543,544,545,546,547,548,549,550,551,552,553,554,555,556,557,558,559,560,561,562,563,564,565,566,567,568,569,570,571,572,573,574,575,576,577,578,579,580,581,582,583,584,585,586,587,588,589,590,591,592,593,594,595,596,597,598,599,600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621,622,623,624,625,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,641,642,643,644,645,646,647,648,649,650,651,652,653,654,655,656,657,658,659,660,661,662,663,664,665,666,667,668,669,670,671,672,673,674,675,676,677,678,679,680,681,682,683,684,685,686,687,688,689,690,691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,728,729,730,731,732,733,734,735,736,737,738,739,740,741,742,743,744,745,746,747,748,749,750,751,752,753,754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,769,770,771,772,773,774,775,776,777,778,779,780,781,782,783,784,785,786,787,788,789,790,791,792,793,794,795,796,797,798,799,800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,835,836,837,838,839,840,841,842,843,844,845,846,847,848,849,850,851,852,853,854,855,856,857,858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,874,875,876,877,878,879,880,881,882,883,884,885,886,887,888,889,890,891,892,893,894,895,896,897,898,899,900,901,902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917,918,919,920,921,922,923,924,925,926,927,928,929,930,931,932,933,934,935,936,937,938,939,940,941,942,943,944,945,946,947,948,949,950,951,952,953,954,955,956,957,958,959,960,961,962,963,964,965,966,967,968,969,970,971,972,973,974,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999';
                    query = '?form_name=test&abributes=brief&tags=' + show_chart;
                    //                query = '?form_name=test&abributes=brief&tags=0,1,2,3,4';
                    doSend(query);
                };

                websocket.onclose = (e) => {
                    writeToScreen("DISCONNECTED");
                };
                websocket.onmessage = (e) => {
                    len = len + e.data.length;
                    len_sec = len_sec + e.data.length;
                    var data = JSON.parse(e.data);
                    packages = packages + 1;
                    packages_sec = packages_sec + 1;
                    //{"items":[{"id": "tag1","sname": "job_control","cur_val": "300"},{"id": "tag11","sname": "control","cur_val": "310"}],
                    //"now": "27.03.2023 21:22:23.44","limit": 25}
                    //"{""items"":[{""id"": ""tag1"",""sname"": ""job_control"",""cur_val"": ""300""},{""id"": ""tag11"",""sname"": ""mycontrol"",""cur_val"": ""310""}] &" & vbCrLf & "          ""tags"":[1,2,3,4], &" & vbCrLf & "          ""now"": ""27.03.2023 21:22:23.44"",""limit"": 25}"
                    fillscreen(data);
                };
                websocket.onerror = (e) => {
                    writeToScreen(`<span class="error">ERROR:</span> ${e.data}`);
                };
                function doSend(message) {
                    writeToScreen(`SENT: ${message}`);
                    websocket.send(message);
                }
                function writeToScreen(message) {
                    $("#salida").append("<p>" + message + "</p>");
                }
                function onClickButton() {
                    var text = $("#cajadetexto").val();
                    text && doSend(text);
                    $("#cajadetexto").val("");
                    $("#cajadetexto").focus();
                }
            });
            function writeToScreen(message) { }
            var el = "";
            var targ = "";
            function fillscreen(data) {
                for (var i = 0; i < data.length; i++) {
                    //document.write("<br><br>array index: " + i);
                    var obj = data[i];
                    for (var key in obj) {
                        var value = obj[key];
                        if (key == "time") {
                            //var temp = '     ' + tags_changed;
                            value = value + " pakages: " + packages + " bytes: " + len + " Tags changed : " + tags_changed;
                            //tags_changed = 0;
                        }
                        var varList = value.split(',');
                        const now = new Date();
                        //const value1 = Math.random() * -90; // Случайное значение для серии 1
                        //const value2 = Math.random() * 1000; // Случайное значение для серии 2
                        if (key == 'tag_id_' + show_chart ) {
                            //console.log(key + " ");
                            if (varList.length == 1) {
                                addData(0, value, now);
				last_val = value;
                                //put_val_by_id(key, value, '');
                                } else {
                                addData(0, varList[0], now);
				last_val = varList[0];
                                //put_val_by_id(key, varList[0], varList[1]);
                                }
                        }

                        

                        //if (varList.length == 1) {
                        //    put_val_by_id(key, value, '');
                        //} else {
                        //    put_val_by_id(key, varList[0], varList[1]);
                        //}
                    }
                }
            }
            function put_val_by_id(id, value, limit) {
                if (document.getElementById(id) != null) {
                    //el = $(("#" + id));
                    el = document.getElementById(id);
                    el.innerHTML = value;
                    if (value > 400 && value < 600) {
                        el.style.backgroundColor = '#99ffff'; //ffff99
                        value = '<b>' + value + '</b>';
                    } else
                        if (limit == '') {
                            el.style.backgroundColor = 'white'; //
                        } else if (limit == 'min') {
                            el.style.backgroundColor = '#ffff99'; //ffff99
                            value = '<b>' + value + '</b>';
                        } else if (limit == 'max') {
                            el.style.backgroundColor = '#ff9999'; //ff9999
                            value = '<b>' + value + '</b>';
                        }
                    el.innerHTML = value;
                    tags_changed = tags_changed + 1;
                    tags_changed_sec = tags_changed_sec + 1;
                } else {
                    console.log(id + " not found");
                }
            }
        </script>
</body>
</html>
